Reports/СостояниеКодовМаркировкиЧЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеКодовМаркировкиЧЗ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияНастроекПанелиПользователя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПанелиПользователя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЭлементаОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВведенКопированием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтобразитьТолькоКМ_НеВОбороте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДокументДляЗапроса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОНанесенииКИЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СостояниеКодовМаркировкиЧЗ/Ext/ObjectModule.bsl
#Область ПодготовкаСКД

Процедура ДобавитьЗначениеОтбора(ТипПоляОтбора, Значение, Представление="", ВидСравнения="", ЗаменитьЕслиЕсть = Истина) Экспорт 
		
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ТипПоляОтбора);
	
	Если НЕ ЗначениеЗаполнено(ВидСравнения) Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
		
	//Найдем в существующих отборах
	флДобавлятьНовый = Истина;
	флЕстьПредставление = ЗначениеЗаполнено(Представление);
	
	Для Каждого ЭлементОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора 
			И ((флЕстьПредставление И ЭлементОтбора.Представление = Представление) ИЛИ (НЕ флЕстьПредставление)) Тогда
			
			флДобавлятьНовый = Ложь;
			
            Если ЗаменитьЕслиЕсть ИЛИ НЕ ЭлементОтбора.Использование Тогда
				
				ЭлементОтбора.Использование = ЗначениеЗаполнено(Значение);
				ЭлементОтбора.ВидСравнения = ВидСравнения;
		   		ЭлементОтбора.ПравоеЗначение = Значение;
				
			КонецЕсли
			
		КонецЕсли;
		
	КонецЦикла;

	//Если не нашли, то добавим отбор
	Если флДобавлятьНовый Тогда    
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = ЗначениеЗаполнено(Значение);
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
		НовыйЭлементОтбора.Представление = Представление;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра(Параметр, Значение, ВключатьПустые = Ложь, ПараметрыНастройки = Неопределено) Экспорт 
	
	Если ПараметрыНастройки = Неопределено Тогда
		Объект = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Параметр));
	Иначе
		Объект = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Параметр));
	КонецЕсли;
	
	Если Объект <> Неопределено Тогда
		
		Объект.Значение = Значение;
		Объект.Использование = ЗначениеЗаполнено(Значение) ИЛИ (ВключатьПустые);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗначениеПараметраВывода(Параметр, Значение) Экспорт
	
	ПолеЗаголовок = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти(Параметр);
	
	Если ПолеЗаголовок <> Неопределено Тогда
		
		ПолеЗаголовок.Значение = Значение;
		ПолеЗаголовок.Использование = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ОбновитьПредставлениеДаты(ЗаписатьПараметры = Истина) Экспорт 
		
	Если ЗаписатьПараметры Тогда
		
		ДобавитьЗначениеПараметра("НачалоПериода",НачалоДня(НачалоПериода),Истина);
		ДобавитьЗначениеПараметра("КонецПериода",КонецДня(?(ЗначениеЗаполнено(КонецПериода),КонецПериода,ТекущаяДата())));
		
	КонецЕсли;	

	Возврат "";
	//Возврат ТекПредставлениеДаты;
 	
КонецФункции

#КонецОбласти

#Область РаботаСОтчетом

Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	Если ТипЗнч(СтруктураСНастройками) <> Тип("Структура") Тогда
		
		СтруктураСНастройками = Новый Структура;
		
	КонецЕсли;
	
	СтруктураСНастройками.Вставить("НачалоПериода", НачалоПериода);
	СтруктураСНастройками.Вставить("КонецПериода", КонецПериода);
	СтруктураСНастройками.Вставить("ОтобразитьТолькоКМ_НеВОбороте", ОтобразитьТолькоКМ_НеВОбороте);
	СтруктураСНастройками.Вставить("ВыводитьОтбор", ВыводитьОтбор);
	СтруктураСНастройками.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	СтруктураСНастройками.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	
КонецПроцедуры

Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Перем ТекНастройки;
	
	Если ТипЗнч(СтруктураСНастройками) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("НачалоПериода", НачалоПериода);
	СтруктураСНастройками.Свойство("КонецПериода", КонецПериода);
	СтруктураСНастройками.Свойство("ВыводитьОтбор", ВыводитьОтбор);
	СтруктураСНастройками.Свойство("ВыводитьЗаголовок", ВыводитьЗаголовок);
	СтруктураСНастройками.Свойство("Настройки", ТекНастройки);
	СтруктураСНастройками.Свойство("ОтобразитьТолькоКМ_НеВОбороте", ОтобразитьТолькоКМ_НеВОбороте);
	
	Если ТекНастройки <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
КонецПроцедуры	

Функция НайтиОбластьЗаголовкаТабличногоДокумента(ТабличныйДокумент) Экспорт
	
	НайденнаяОбласть = Неопределено;
	
	Для ТекСтрока = 1  По ТабличныйДокумент.ФиксацияСверху Цикл
		
		Область = ТабличныйДокумент.Область(ТекСтрока,1,ТекСтрока,1);
		Если Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить
			И Область.ГраницаСверху.Толщина > 0
			И Область.ГраницаСнизу.Толщина > 0
			И Область.ГраницаСлева.Толщина > 0
			И Область.ГраницаСправа.Толщина > 0 Тогда
			
			//Началась шапка отчета
			//Меторд немного корявый, но работает. При изменении шапки отчета в Макете оформления
			//компоновки данных необходимо изменить и алгоритм нахождения шапки.
			НайденнаяОбласть = ТабличныйДокумент.Область(1,,ТекСтрока-1,);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденнаяОбласть;
	
КонецФункции

Процедура УстановитьЗаголовокОтчета(СинонимОтчета="") Экспорт
	
	Если НЕ ЗначениеЗаполнено(СинонимОтчета) Тогда
		СинонимОтчета = ЭтотОбъект.Метаданные().Синоним;
	КонецЕсли;
	
	ДобавитьЗначениеПараметраВывода("Заголовок", СинонимОтчета);
	ДобавитьЗначениеПараметраВывода("ВыводитьЗаголовок", ТипВыводаТекстаКомпоновкиДанных.Выводить);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаДанных

Функция ПолучитьТаблицуДанных() Экспорт

	СхемаПервичныхДанных = ПолучитьМакет("СхемаИсходныхДанных");
	
	КомпоновщикНастроекПервичныхДанных = Новый КомпоновщикНастроекКомпоновкиДанных;  
	КомпоновщикНастроекПервичныхДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаПервичныхДанных));  
	КомпоновщикНастроекПервичныхДанных.ЗагрузитьНастройки(СхемаПервичныхДанных.НастройкиПоУмолчанию);  
	
    НастройкиПервичныхДанных = КомпоновщикНастроекПервичныхДанных.Настройки;

	// Добавим отбор для запроса первичных данных
	НастройкиПервичныхДанныхОтбор = НастройкиПервичныхДанных.Отбор.Элементы;
	НастройкиПервичныхДанныхОтбор.Очистить();	

	НастройкаВыводаОтбор = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для каждого ТекОтбор Из НастройкаВыводаОтбор Цикл
		
		Если	ТекОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Контрагент") 
			ИЛИ ТекОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Документ")
			ИЛИ ТекОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Номенклатура") 
			ИЛИ ТекОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ШтрихкодМаркировки")
			ИЛИ ТекОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("КодМаркировки")
			ИЛИ ТекОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Производитель")
			Тогда
			
			НовОтбор = НастройкиПервичныхДанныхОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовОтбор, ТекОтбор);
			
		КонецЕсли;
		
	КонецЦикла;

	ДобавитьЗначениеПараметра("НачалоПериода",НачалоДня(?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода,ТекущаяДата())),, НастройкиПервичныхДанных.ПараметрыДанных);
	ДобавитьЗначениеПараметра("КонецПериода",КонецДня(?(ЗначениеЗаполнено(КонецПериода),КонецПериода,ТекущаяДата())),, НастройкиПервичныхДанных.ПараметрыДанных);
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаПервичныхДанных, НастройкиПервичныхДанных, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	// Отправляем запрос в ЧЗ и дозаполняем таблицу данных 
	ТаблицаДанных.Колонки.Добавить("ДатаПроизводства", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДанных.Колонки.Добавить("СрокГодности", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДанных.Колонки.Добавить("Статус", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаДанных.Колонки.Добавить("ИННВладельца", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаДанных.Колонки.Добавить("НаименованиеВладельца", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	ДозаполнитьСостояниеКодовМаркировкиИзЧЗ(ТаблицаДанных);

	// дополнительный фильтр по статусу
	Если ОтобразитьТолькоКМ_НеВОбороте Тогда
		
		мСтрокиКУдалению = ТаблицаДанных.НайтиСтроки(Новый Структура("Статус", "В обороте"));
		
		Для Каждого ТекСтрока Из мСтрокиКУдалению Цикл
			ТаблицаДанных.Удалить(ТекСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаДанных; 
	
КонецФункции

Процедура ДозаполнитьСостояниеКодовМаркировкиИзЧЗ(ТаблицаДанных)
	
	ТаблицаДанных.Индексы.Добавить("КодМаркировки");
		
	МаксимальноеКоличествоКодовМаркировкиВЗапросе = 1000;
	мКодыМаркировкиДляЗапроса = Новый Массив;
	
	сч = 1;
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.КодМаркировки) Тогда
			Продолжить;
		КонецЕсли;
		
		мКодыМаркировкиДляЗапроса.Добавить(СтрокаДанных.КодМаркировки);
		
		Если мКодыМаркировкиДляЗапроса.Количество() = МаксимальноеКоличествоКодовМаркировкиВЗапросе 
			ИЛИ сч = ТаблицаДанных.Количество() Тогда
			
			// набрали блок для обработки за один запрос либо конец таблицы
			мОтветЧЗ = ПолучитьДанныеИзЧЗ(мКодыМаркировкиДляЗапроса);
			
			// добавляем полученные данные из ЧЗ
			Для Каждого ЗаписьЧЗ Из мОтветЧЗ Цикл
				
				мСтрокиПоКМ = ТаблицаДанных.НайтиСтроки(Новый Структура("КодМаркировки", ЗаписьЧЗ.requestedCis));
				
				Для Каждого СтрокаПоКМ из мСтрокиПоКМ Цикл
					
					СтрокаПоКМ.ДатаПроизводства = ЗаписьЧЗ.producedDate;
					СтрокаПоКМ.СрокГодности = ЗаписьЧЗ.expirationDate;
					СтрокаПоКМ.ИННВладельца = ЗаписьЧЗ.ownerInn;
					СтрокаПоКМ.НаименованиеВладельца = ЗаписьЧЗ.ownerName;
					СтрокаПоКМ.Статус = ПолучитьСтатусКМ(ЗаписьЧЗ.status);
					
				КонецЦикла;
				
			КонецЦикла;
			
			мКодыМаркировкиДляЗапроса = Новый Массив;
			
		КонецЕсли;
		
		сч = сч + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеИзЧЗ(мКодыМаркировкиДляЗапроса)
	
	мОтвет = Новый Массив;
	
	// Адрес сервера
	АдресСервераЧестныйЗнак = "10.90.100.31:30209";
	
	Если Метаданные.Константы.Найти("АдресСервераЧестныйЗнак") <> Неопределено Тогда
		
		АдресСервераЧестныйЗнакИзКонстанты = Константы.АдресСервераЧестныйЗнак.Получить();
		
		Если ЗначениеЗаполнено(АдресСервераЧестныйЗнакИзКонстанты) Тогда
			АдресСервераЧестныйЗнак = АдресСервераЧестныйЗнакИзКонстанты;
		КонецЕсли;
		
	КонецЕсли;	
	
	// Строка запроса
	ОсновнаяОрганизация = Константы.ОсновнаяОрганизация.Получить();
	КодМДМГоловнойОрганизации = ОсновнаяОрганизация.КодМДМГоловнойОрганизации;
	
	СтрокаЗапроса = "/api/v1/km_info?orgId=" + КодМДМГоловнойОрганизации;
	
	// Тело запроса
	СтруктураПоКодуМаркировки = Новый Структура;
	СтруктураПоКодуМаркировки.Вставить("codes", мКодыМаркировкиДляЗапроса);
			
	ТелоЗапроса = СериализоватьВJSON(СтруктураПоКодуМаркировки);
	
    // Сама отправка
	HTTPСоединение = Новый HTTPСоединение(АдресСервераЧестныйЗнак);
	
	HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса); 	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
				
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);     //Получить(HTTPЗапрос);
		ОтветJSONСтрока = Ответ.ПолучитьТелоКакСтроку();
	
		Если Ответ.КодСостояния = 200 Тогда	
			
			мПоляДата = Новый Массив;
			мПоляДата.Добавить("producedDate");
			мПоляДата.Добавить("expirationDate");
			
			мОтветИсходный = ДесериализоватьИзJSON(ОтветJSONСтрока, мПоляДата);
			мОтвет = мОтветИсходный.list;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить/обработать данные от Честного знака. Код состояния " + Ответ.КодСостояния);
		КонецЕсли;
		
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка связи с сервисом Честного знака: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат мОтвет;
	
КонецФункции

Функция СериализоватьВJSON(Значение) Экспорт
    
    Настройки = Новый НастройкиСериализацииJSON();
    Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Значение, Настройки);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    Возврат СтрокаJSON;
    
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
	
	Возврат Значение;
    
КонецФункции

Функция ПолучитьСтатусКМ(СтатусЧЗ)
	
	Статус = "";
	
	Если СтатусЧЗ = "EMITTED" Тогда
		Статус = "Эмитирован";
	ИначеЕсли СтатусЧЗ = "APPLIED" Тогда
		Статус = "Нанесён";
	ИначеЕсли СтатусЧЗ = "INTRODUCED" Тогда
		Статус = "В обороте";
	ИначеЕсли СтатусЧЗ = "WRITTEN_OFF" Тогда
		Статус = "Списан";
	ИначеЕсли СтатусЧЗ = "RETIRED" Тогда
		Статус = "Выбыл";	
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти
